.config/yadm/bootstrap.d/140-gcloud.sh##c.personal,e.sh
#!/bin/bash
# Gcloud


# [[file:../../../README.org::*Gcloud][Gcloud:1]]
set -eux

sudo apt-get install apt-transport-https ca-certificates gnupg
echo "deb [signed-by=/usr/share/keyrings/cloud.google.gpg] https://packages.cloud.google.com/apt cloud-sdk main" | sudo tee /etc/apt/sources.list.d/google-cloud-sdk.list
curl https://packages.cloud.google.com/apt/doc/apt-key.gpg | sudo apt-key --keyring /usr/share/keyrings/cloud.google.gpg add -
sudo apt-get update && sudo apt-get install google-cloud-sdk
# Gcloud:1 ends here
